[Language]
Code="be"
Name="Беларускі"
Translator="Yury Yatsynovich <yury.yatsynovich@gmail.com>"
Dir="ltr"

[MainFrame]
Title="Lingoes"
Close="Закрыць"
Maximize="Максімізаваць"
Minimize="Мінімізаваць"
Restore="Аднавіць"
Menu="Асноўнае меню"

; Status Icon
[NotifyIcon]
Tip="Lingoes\nПераклад тэксту пад курсорам: [$CursorStatus]\nПераклад выдзеленага тэксту: [$SelectionStatus]\nПераклад буфера абмену: [$ClipboardStatus]"
InfoTitle="Lingoes"
Info="Пераклад тэксту пад курсорам:\t[$CursorStatus]\nПераклад выдзеленага тэксту:\t[$SelectionStatus]\nПераклад буфера абмену:\t[$ClipboardStatus]"
Enabled="Задзейнічаны"
Disabled="Адключаны"

[MainMenu]
Open="Адкрыць"
CursorTranslator="Пераклад тэксту пад курсорам"
SelectionTranslator="Пераклад вылучанага тэксту"
ClipboardTranslator="Пераклад буфера абмену"
Configuration="Наладкі..."
Dictionaries="Слоўнікі..."
Activation="Актывацыя прадукту"
UpdateOnline="Абнавіць праз сеціва"
Help="Даведка"
About="Пра Lingoes"
SupportOnline="Падтрымка праз сеціва"
Exit="Выхад"

[DlgInput]
Back="Назад"
Forward="Наперад"
MainMenu="Асноўнае меню"
HistoryList="Паказаць гісторыю"
Search="Пошук", "Пошук дэталёвых тлумачэнняў"
WebSearch="Пошук у сеціве"
AutoMatch="Аўтаматычнае стасаванне", "Аўтаматычнае стасаванне па індэкснаму гурту"
MatchSetup="Наладкі індэкснага гурта..."
FindEngine="Атрамаць болей машын пошуку..."

[DlgIndex]
Index="Індэкс"
Guide="Дапаможнік"
Appendix="Дадатак"
NoIndex="Няма індэксу"
AddIndexGroup="<div style=\"margin: 10; font-family: '[$TextFont]'; font-size: [$TextFontSize]pt\">Дадаць слоўнік у <b>індэксны гурт </b>, Вы можаце пачуць прамаўленне пры ўводзе слова.<br/><br/><a href=\"app://dictionary_group/[$IndexGroupID]\"><u>Для ўпраўлення індэксным гуртом пстрыкніце тут.</u></a></div>"

[WebGuide]
Results="Вынікі"
Spelling="Альтэрнатыва прамовы"
Appendices="Дадаткі"
Options="Настаўленні"
Dictionaries="Слоўнікі...", "Упраўляць слоўнікамі"
Configuration="Настаўленне...", "Адкрыць дыялог настаўленныў"
Help="Даведка", "Адкрыць даведку Lingoes"
Homepage="lingoes.net", "Наведаць старонку Lingoes у сеціве"
Community="Lingoes суполка", "Суполка Lingoes у сеціве"

[DlgStatus]
KeepVisible="Трымаць акно заўсёды паверх"

[DlgView]
Speak="Прамовіць", "Прамовіць вылучаны тэкст"
Search="Пошук"
Copy="Капіяваць"
Print="Друкаваць..."
Save="Захаваць..."
Find="Знайсці..."
SelectAll="Вылучыць усё"
TextTranslate="Пераклад", "Запуск перакладу тэксту"
StartPage="", "Пачатковая старонка"
ShowIndex="Паказаць бакавую панэль"
HideIndex="Схаваць бакавую панэль"
SaveFilter="HTML файл (*.htm; *.html)|*.htm;*.html|"
SpeechOption="Наладкі прамовы..."
SelectVoice="Выбраць голас"
Activation="Актывацыя", "Майстар актывацыі Lingoes"

[DlgRegister]
Title="Lingoes - рэгістрацыя камерцыйнага карыстальніка"
FreeDownload="Lingoes бясплатны для выкарыстання ў некамерцыйных мэтах.\r\nЗапампаваць бясплатную версію тут..."
Name="Імя карыстальніка:", "Імя карыстальніка з'яўляецца абавязковым"
Email="E-mail карыстальніка:", "E-mail карыстальніка з'яўляецца абавязковым"
RegCode="Рэгістрацыйны код:", "Рэгістрацыйны код нядзейсны"
Support="Сэрвіс кліентаў"
Register="Зарэгістраваць", "Захаваць рэгістрацыйную інфармацыю памылка"
Exit="Выхад"

[DlgInfo]
Title="Паведамленне"
Ok="Добра"
Cancel="Скасаваць"
Yes="Так"
No="Не"
Retry="Паўтарыць"
Abort="Перапыніць"
Ignore="Прапусціць"

[DlgAuthentication]
Title="Злучыцца "
TitleProxy="Далучыць сэрвер проксі "
Username="Імя карыстальніка:"
Password="Пароль:"
Remember="Памятаць мой пароль"
Ok="Добра"
Cancel="Скасаваць"

[WndGrab]
Open="Пошук дэталёвых тлумачэнняў"
Speak="Прамовіць"
Copy="Капіяваць"
TextTranslation="Пераклад тэксту"
KeepSize="Захаваць памеры акна"
KeepVisible="Трымаць акно заўсёды паверх"
Back="Назад" 
Forward="Наперад"
Search="Search\n  Enter:\t\tSearch\n  Ctrl + Enter:\tSearch detaied explanations\n  Shift + Enter:\tText Translation\n  Alt + Enter:\tWeb Search"

[DlgDictOption]
Title="Наладкі перакладніка"
NetInstall="Устанавіць з Lingoes", "Устанавіць слоўнік з старонкі Lingoes"
Install="Устанавіць", "Устанавіць слоўнік з дыска"
Uninstall="Высталяваць", "Высталяваць слоўнік"
Add="Дадаць", "Дадаць слоўнік да спісу"
Remove="Выдаліць", "Выдаліць гэты слоўнік са спісу"
Download="Запампаваць", "Запампаваць гэты слоўнік для выкарыстання па-за сецівам"
MoveTop="", "Перамясціць у пачатак"
MoveUp="", "Перамясціць уверх"
MoveDown="", "Перамясціць уніз"
MoveBottom="", "Перамясціць уканец"
MoreDetails="", "Прагледзець дэталі слоўніка"
Close="Закрыць"

Installed="Устаноўленыя слоўнікі"
Query="Устаноўленыя слоўнікі"
Index="Гурт індэксу"
Grab="Гурт пераклыду выдзеленага тэксту"

InstalledList="Устаноўленыя слоўнікі"
QueryList="Устаноўленыя слоўнікі"
IndexList="Спіс гурта індэксу"
GrabList="Спіс гурта пераклыду выдзеленага тэксту"
DictID="Ідэнтыфікацыйны нумар"
Online="У сеціве"

Type="Type"
OnlineType="Патрабуецца сувязь с Інтэрнетам"
AddFilter="Слоўнікі Lingoes (*.ld2, *.ldp)|*.ld2;*.ldp|"
InstallDict="Устанавіць слоўнік"
Installing="Устаноўка..."

[DlgDictList]
Title="Дадаць слоўнікі"
Add="Дадаць"
Cancel="Скасаваць"
Select="Выбраць"
DictList="Устаноўленыя слоўнікі"
ID="Ідэнтыфікацыйны нумар"
Online="У сеціве"

[DlgDictInfo]
Title="Дэталі Слоўніка"
Close="Добра"

ID="Ідэнтыфікацыйны нумар"
MD5="MD5"
Name="Імя"
Version="Версія"
Date="Дата стварэння"
Update="Апошняе абнаўленне"
IndexCount="Слоў усяго"
Language=Language
MoreLanguage=More..
DictTitle="Загаловак"
DictEdition="Рэдакцыя"
DictDescription="Апісанне"
PubAuthor="Аўтар"
PubEmail="Email"
PubWebsite="Старонка ў сеціве"
PubCopyright="Copyright"
Filename="Імя файла"

; Install Dictionaries
[DlgDictInstall]
Title="Устанавіць слоўнік"
InstallSucceed="Паспяховая устаноўка слоўніка \"[$DictTitle]\""
DictGroupOption="Наладкі"
AddIndexGroup="Дадаць да \"Гурта індэксу\""
AddIndexGroupDesc="Lingoes будзе ажыццяўляць пошук па слоўніках ў гурце індэксу і падказваць найбліжэйшы вынік у індэкснай панэлі падчас набору."
AddGrabGroup="Дадаць да \"гурта пераклыду выдзеленага тэксту\""
AddGrabGroupDesc="Lingoes будзе ажыццяўляць пошук па слоўніках ў гурце пераклыду выдзеленага тэксту і адлюстроўваць вынік перакладу ў акне выдзеленага тексту падчас выдзялення."
Ok="Добра"

; Configuration
[DlgOption]
Title="Настаўленне"
Ok="Добра"
Cancel="Скасаваць"
General="Агульныя"
Appearance="Выгляд"
Connection="Сувязь"
Speech="Маўленне"
Hotkey="Клавішы хуткага доступу"
Translate="Пераклад"
License="Ліцэнзіі"
Capture="Выдзяленне тэксту"

; General
[DlgOptGeneral]
Language="Мова"
UILanguage="Мова інтэрфэйсу карыстальніка"

WebSearch="Пошук у сеціве"
SelectWebSearch="Абраць пашуковы механізм для пошуку ў сеціве"

TermHistory="Гісторыя && Кэш"
SaveHistory="Словы пошуку, захаваныя ў гісторыі"
ClearHistory="Ачысціць гісторыю"
ClearHistoryConfirmation="Вы ўпэўнены, што жадаеце ачысціць гісторыю?"

ResultCache="Лакальны кэш сеткавага слоўніка"
ClearCache="Ачысціць кэш", "Вы ўпэўнены, што жадаеце ачысціць кэш?"

AutoStart="Запускаць Lingoes калі я заходжу ў Windows"
StartMin="Мінімізаваць пасля запуску"

; Appearance
[DlgOptAppearance]
UserInterface="Інтэрфэйс карыстальніка"
WindowStyle="Стыль акна"
WindowFont="Шрыфт тэксту акна"
WindowFontSize="Памер шрыфту"
WindowFontSizeList="7", "8", "9", "10", "10.5", "11"
ResultDisplay="Адлюстраванне выніку"
TextFont="Шрыфт тэксту"
TextFontSize="Памер шрыфту"
TextFontSizeList="7", "8", "9", "10", "10.5", "11", "12", "13", "14", "16", "18", "20", "22", "24", "26", "28", "32", "36", "48"
PhoneticFont="Фанетычны шрыфт"
CursorTranslatorBar="Акно выдзялення тэксту"
FontColor="Колер шрыфту"
BackColor="Колер фону"
BorderColor="Колер мяжы"
Transparence="Прасвечваючае акно выдзялення тэксту"
SampleText="Выдзяленне тэксту"

[Style]
0="Няма"
1="Звычайны стыль"

; Translate
[DlgOptTranslate]
SupportLCMap="Падтрымоўваць адлюстраванне мясцовай мовы"
InstantTranslation="Імгненны пераклад"
TargetLanguage="Мэтавая мова:"
CurrentUserLanguage="Мова цяперашняга карыстальніка"
TargetLanguage2="Калі мэтавая мова такая самая, як і мова крыніцы, скінуць на:"
NoTranslate="Без перакладу"

; Capture
[DlgOptCapture]
CursorActivation="Выдзеліць слова на экране"
MouseActivation="Спосаб актывацыі мышы:"
MouseOver="Mouse-over"
LeftMouseButton="Левая кнопка мышы"
MiddleMouseButton="Сярэдняя кнопка мышы"
RightMouseButton="Правая кнопка мышы"
MouseXButton1="Мыш X Кнопка1"
MouseXButton2="Мыш X Кнопка2"
TimeDelay="Затрымка часу:"
MSEL="мілісекунд"
IgnoreNumber="Ігнараваць лічбу"
IgnoreLatin="Ігнараваць лацінскі (англійскі, французскі, нямецкі, іспанскі, г.д.)"
IgnoreCJK="Ігнараваць кітайскі, японскі і карэйскі"
IgnoreCyrillic="Ігнараваць кірыліцу (рускі, укарінскі, балгарскі, г.д.)"
IgnoreArabic="Ігнараваць арабскі, яўрэйскі"
InstallAdobePlugin="Устанавіць Adobe Acrobat PDF дадатак"
ZonedWord="Перакласці выдзелены тэкст"
ZonedWordFilterRule="Фільтраваць правілы для выдзялення тэксту..."
ShowOnlyFirstResult="Адлюстроўваць толькі першы вынік пошуку"

; Capture - Zoned Word Filter
[DlgOptTranslateZWFilter]
Title="Фільтраваць правілы для выдзялення тэксту"
ProgramFilename="Імя файла праграмы", "Імя файла праграмы (Азначыць усе праграмы, калі адсутнічае)"
WndClassName="Імя класу акна", "Імя класу акна (значыць усе вокны, калі адсутнічае)"
DisableSelect="Ігнараваць вылучэнне", "Ігнараваць вылучэнне"
DisableDBLClick="Ігнараваць падвойны пстрычок", "Ігнараваць падвойны пстрычок"
Comment="Каментаваць", "Каментаваць"
Add="Дадаць"
Modify="Змяніць"
Delete="Выдаліць", "Вы ўпэўнены, што жадаеце выдаліць гэты элемент?"
Ok="Добра"
Cancel="Скасаваць"
LoadDefault="Загрузіць прадвызначаныя", "Вы ўпэўнены, што жадаеце загрузіць прадвызначаныя наладкі?"
Browser="...", "Прагляд", "Праграма (*.exe)|*.exe|"
Capture="...", "Клас імя акна выдзялення"
AllProgram="-- Усе праграмы --"
AllWindow="-- Усе вокны --"

[WndClassNameCapture]
Title="Клас імя акна выдзялення"
ProgramFilename="Імя файла праграмы"
WndClassName="Клас імя акна"
Capture="Выдзеліць гэта з экрана"

; Speech
[DlgOptSpeech]
RPPEngine="Механізм натуральнага маўлення"
RPPEnable="Задзейнічаць"
RPPVoice="Голас"
RPPRebuildIndexFile="Перабудаваць файл індэкса", "Няўдалая перабудова індэкса! \nВы можаце ня мець дастатковых правоў доступу да файла."
Engine="Механізм Тэкст-у-Маўленне (TTS)"
Voice="Голас"
Enable="Задзейнічаць"
Volume="Гучнасць"
Pitch="Інтанацыя"
Speed="Хуткасць"
RealtimePron="Прамаўленне у рэальным часе"
PronInQuery="Падчас пошуку слова"
PronInCapture="Падчас выдзялення тэксту"
Test="Тэставаць"
EnterText="Увядзіце тэкст і выпрабуйце гэты голас"
DownloadTTS="Запампаваць пакет галасавога механізму..."

; Connect
[DlgOptConnection]
ConnectSet="Наладкі сувязі"
DirectConnect="Прамая сувязь"
IEProxyConnect="Выкарыстоўваць наладкі проксі для вашага вандроўніка"
ProxyConnect="Усталяваць сувязь праз проксі/ сервер Firewall"
ProxyServer="Сервер проксі:"
ProxyPort="Порт:"
Username="Імя карыстальніка:"
Password="Пароль:"
OnlineUpdate="Абнавіць праз сеціва"
UpdateNow="Абнавіць цяпер"
EnableUpdate="Задзейнічаць абнаўленне праз сеціва"

; Hotkey
[DlgOptHotkey]
OpenMainWnd="Адкрыць асноўнае акно"
GrabToggleKey="Пераклад слова пад курсорам"
SelectionToggleKey="Перакласці выдзелены тэкст"
ClipboardToggleKey="Перакласці буфер абмену"
Pronounce="Прамовіць"
CopyInterpretation="Капіяваць змест перакладу"

[DlgExpire]
Title="Скончыўся тэрмін дзеяння Lingoes"
Ok="Удасканаліць цяпер"
Cancel="Выхад"
NetworkSettings="Наладкі сеціва"
Support="Lingoes.net"
AskUpgrade="У гэтай версіі скончыўся тэрмін дзеяння, вам неабходна удасканаліць да новай версіі! \nУдасканаліць да новай версіі?"

[DlgAbout]
DlgTitle="Пра Lingoes"
Version="Версія: "
PortableEdition="Партатыўнае выданне"
Email="Email адрас"
Website="Lingoes старонка ў сеціве"
LicenseTo="Гэты прадукт ліцэнзаваны на:"
LicenseID="Ідэнтыфікацыйны нумар: "

[WebResult]
SpellingAlternatives="Альтэрнатывы правапісу"
SpellChecker="Праверка правапісу"
TextTranslation="Пераклад тэксту"
WebSearch="Пошук у сеціве"
MoreResults="Болей вынікаў"
WaitSearch="Запыт вынікаў пошуку..."
NoMatch="<div id='dict_result_nomatch' style=\"font-family:'[$TextFont]'; font-size:[$TextFontSize]pt; line-height:normal; padding:10; display:[$Display]\"><b>Супадзенняў не было знойдзена для \"<font color='#C00000'>[$SearchKey]</font>\".</b></div>"

[WebStartPage]
StartPageTpl="<table id='startpage' width='100%' height='100%' border='0' cellspacing='0' cellpadding='10' onselectstart='return false'><tr><td align='center' style=\"font-family: '[$Font]'; font-size: [$FontSize]pt; line-height: 1.2em\"><a href='app://homepage/'><img border='0' src='[$ImgPath]logomain.png' width='134' height='40' style='margin-bottom:50'></a></td></tr></table>"
HelpTip="Як карыстацца Lingoes"
DownDictTip="Запамповаць болей слоўнікаў"
Intro="Падтрымка крыжаванага перакладу болей як з 80 моў<br>Пераклад пад курсорам, пераклад тэксту і вымаўленне тэксту"

[TextTranslation]
Title="Пераклад тэксту"
To="у"
Translate="Перакласці"
RequestFailed="Няўдалы запыт да сэрвісаў перакладу."
ConnectFailed="Lingoes ня ўдалося злучыцца с серверам. Калі вы злучаны з Інтэрнэтам, калі ласка, праверце наладкі злучэння. "
WaitRequest="Запыт вынікаў пошуку..."
ParseResultFailed="Аналізаваць памылкі вынікаў перакладу. Калі вы атрымалі гэта паведамленне некалькі разоў, калі ласка, паведаміце нам."

; Layout
[Layout]
DictMenu="Меню слоўніка"
ShowResult="Адлюстраваць вынік"
MinimizeResult="Мінімізаваць вынік"
FindWord="Знайсці: "

; Dictionary Menu
[DictMenu]
About="Пра..."
Enable="Задзейнічаць"
Disable="Адключыць"
DisableMsg="Слоунік адключаны і не будзе адлюстроўваць вынікі!\nВы можаце задзейнічаць яго праз дыялог \"Слоўнікі\" ."
MoveTop="Устанавіць як вынік зверху"
ArrangeResults="Размясціць вынікі..."
IndexGroup="  (Гурт індэксу)"
QueryGroup="  (Гурт запыту)"
GrabGroup="  (Гурт выдзялення тэксту)"

[Update]
Title="Абнавіць праз сеціва"
AskUpgrade="Знойдзена новая версія. Вы жадаеце абнавіць да гжтай новай версіі?"
UpgradeNow="Знойдзена новая версія. Неабходна абнайленне да гэтай новай версіі."
UpdateSuccess="Удалае абнаўленне!"
UpdateFail="Няўдалае абнаўленне!"
NoUpdate="Цяперашняя версія з'яўляецца самай апошняй"

CheckUpdate="Checking update..."
GetUpdateInfo="Getting updated information..."
DownUpdateData="Downloading updated data..."
ExecUpdate="Updating system..."
GetUpgradeInfo="Getting upgraded information..."
DownUpgradeData="Downloading upgraded data..."
ExecUpgrade="Upgrading system..."
NeedExitForUpgrade="Lingoes will quit for finishing upgrade"

[Message]
InitUpdateServerFail="Памылка ініцыалізацыі сервісу аўтаабнаўлення "
StartDictServerFail="Памылка запуску сервісу слоўніка."

DictFileErr="Няправільны фармат файла!\n[$Filename]"
DictVersinTooOld="[$Filename]\nВерсія гэтага слоўніка ([$DictVer]) вельмі старая, калі ласка, абнавіце яго.\n\nНаведаць старонку Lingoes у сеціве для пошуку апошняй версіі?"
DictVersinTooNew="[$Filename]\nВерсія гэтага слоўніка ([$DictVer]) патрабуе новай версіі Lingoes.\n\nЗапампаваць апошнюю версію з старонкі Lingoes у сеціве цяпер?"

AskDictRepeatInstall="Спіс слоўнікаў уключае слоўнік \"[$DictTitle]\",\nЖадеце працягваць?"
InstallDictFail="Памылка ўстаноўкі слоўніка:\n[$Filename]"
AskUninstall="Вы ўпэўнены, что жадаеце высталяваць слоўнік?\n\n[$DictTitle]\nID: [$DictID]"
UninstallDictFail="Памылка высталявання слоўніка\n\n[$DictTitle]\nID: [$DictID]"
AskRemoveFromGroup="Вы ўпэўнены, что жадаеце выдаліць слоўнік \"[$DictTitle]\" з спіса?"

MemoryAllocFail="Памылка размеркавання памяці."
FilenameInvalid="Няправільнае тмя файла."
SaveFileFail="Памылка захавання"
OpenFileFail="Памылка адкрыцця"

AreYouAbort="Вы ўпэўнены, что жадаеце перарваць цякучы працэс?"
CreateThreadFail="Памылка стварэння сувязі"
CreateEventFail="Памылка апрацоўкі падзей"
Unfulfilment="Магчамасуь не рэалізавана"
OnlyProVersion="Гэта магчымасць толькі для Pro версіі."
NoRegister="Гэта незарэгістраваная версія, калі ласка, зарэгіструйце Lingoes для выкарыстання гэтай магчымасці."
UsernameIsEmpty="Імя карыстальніка адсутнічае, калі ласка, запоўніце яго."
SaveSearchResultFail="Памылка захавання вынікаў пошуку."

OpenAppendixFail="Памылка адкрыцця зместу дадатка."
OpenSpeechEngineFail="Памылка загрузкі TTS механізму, калі ласка, праверце, ці устаноўлены TTS механізм на вашым кампутары! \n\nВам неабходна устанавіць TTS механизм на вашу аперацыйную систэму. У иншым выпадку, кали ласка, запампуйце и устанавице яе з старонки Lingoes у сециве \n\nВы жадаеце запампаваць яго цяпер?"

; NeedIE6Support="Lingoes патрэбен Internet Explorer 6+, калі ласка, абнавіце ваш вандроўнік да IE6+"
NoImplement="Прашу прабачэння, магчымасць не рэалізавана"
